In [1]:
import pandas as pd

files = ["ap_2010.csv","class_size.csv","demographics.csv",
         "graduation.csv",
         "hs_directory.csv", "sat_results.csv"]

In [2]:
# pd.read_csv("schools/ap_2010.csv")

In [4]:
data = {}

for f in files:
    df =  pd.read_csv("schools/{}".format(f))
    key = f.replace(".csv", "")
    data[key] = df

In [8]:
all_survey = pd.read_csv("schools/survey_all.txt", delimiter = "\t", encoding = "latin-1")

In [9]:
d75_survey = pd.read_csv("schools/survey_d75.txt", delimiter = "\t", encoding = "latin-1")

In [10]:
survey = pd.concat([all_survey,d75_survey], axis = 0)

# Data Wrangling

In [11]:
data["sat_results"].head()

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370
3,01M458,FORSYTH SATELLITE ACADEMY,7,414,401,359
4,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384

In [12]:
survey.columns

Index(['dbn', 'bn', 'schoolname', 'd75', 'studentssurveyed', 'highschool',
       'schooltype', 'rr_s', 'rr_t', 'rr_p',
       ...
       's_q14_2', 's_q14_3', 's_q14_4', 's_q14_5', 's_q14_6', 's_q14_7',
       's_q14_8', 's_q14_9', 's_q14_10', 's_q14_11'],
      dtype='object', length=2773)

In [13]:
survey.shape

(1702, 2773)

In [14]:
survey["DBN"] = survey['dbn']

In [15]:
survey_fields = ["DBN", "rr_s", "rr_t", "rr_p", "N_s", "N_t", "N_p", "saf_p_11", 
        "com_p_11", "eng_p_11", "aca_p_11", "saf_t_11", "com_t_11", "eng_t_11", 
        "aca_t_11", "saf_s_11", "com_s_11", "eng_s_11", "aca_s_11", "saf_tot_11", 
        "com_tot_11", "eng_tot_11", "aca_tot_11"]

In [16]:
survey = survey[survey_fields]

In [18]:
data.keys()

dict_keys(['ap_2010', 'class_size', 'demographics', 'graduation', 'hs_directory', 'sat_results'])

In [19]:
data["survey"] = survey

In [20]:
data.keys()

dict_keys(['ap_2010', 'class_size', 'demographics', 'graduation', 'hs_directory', 'sat_results', 'survey'])

In [23]:
# data['hs_directory'].head()

In [22]:
data['hs_directory']["DBN"] = data['hs_directory']["dbn"]

In [25]:
# data['hs_directory'].head()

In [38]:
data['class_size'].head(1)

,CSD,BOROUGH,SCHOOL CODE,SCHOOL NAME,GRADE,PROGRAM TYPE,CORE SUBJECT (MS CORE and 9-12 ONLY),CORE COURSE (MS CORE and 9-12 ONLY),SERVICE CATEGORY(K-9* ONLY),NUMBER OF STUDENTS / SEATS FILLED,NUMBER OF SECTIONS,AVERAGE CLASS SIZE,SIZE OF SMALLEST CLASS,SIZE OF LARGEST CLASS,DATA SOURCE,SCHOOLWIDE PUPIL-TEACHER RATIO,padded_csd
0,1,M,M015,P.S. 015 Roberto Clemente,0K,GEN ED,-,-,-,19.0,1.0,19.0,19.0,19.0,ATS,NaN,01

In [36]:
data['class_size']["padded_csd"] = data['class_size']["CSD"].astype(str).str.zfill(2)

In [34]:
# "Waqa".zfill(6)

In [37]:
data['class_size']["padded_csd"].head()

0    01
1    01
2    01
3    01
4    01
Name: padded_csd, dtype: object

In [39]:
data['class_size']["DBN"] = data['class_size']["padded_csd"] + data['class_size']["SCHOOL CODE"]

In [40]:
data['class_size']["DBN"].head()

0    01M015
1    01M015
2    01M015
3    01M015
4    01M015
Name: DBN, dtype: object

In [41]:
data["sat_results"].head()

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370
3,01M458,FORSYTH SATELLITE ACADEMY,7,414,401,359
4,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384

In [42]:
data["sat_results"].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 478 entries, 0 to 477
Data columns (total 6 columns):
 #   Column                           Non-Null Count  Dtype
---  ------                           --------------  -----
 0   DBN                              478 non-null    object
 1   SCHOOL NAME                      478 non-null    object
 2   Num of SAT Test Takers           478 non-null    object
 3   SAT Critical Reading Avg. Score  478 non-null    object
 4   SAT Math Avg. Score              478 non-null    object
 5   SAT Writing Avg. Score           478 non-null    object
dtypes: object(6)
memory usage: 22.5+ KB

In [44]:
cols = ["SAT Critical Reading Avg. Score","SAT Math Avg. Score","SAT Writing Avg. Score"]

for c in cols:
    data["sat_results"][c] = pd.to_numeric(data["sat_results"][c], errors = "coerce")

In [45]:
data["sat_results"].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 478 entries, 0 to 477
Data columns (total 6 columns):
 #   Column                           Non-Null Count  Dtype
---  ------                           --------------  -----
 0   DBN                              478 non-null    object
 1   SCHOOL NAME                      478 non-null    object
 2   Num of SAT Test Takers           478 non-null    object
 3   SAT Critical Reading Avg. Score  421 non-null    float64
 4   SAT Math Avg. Score              421 non-null    float64
 5   SAT Writing Avg. Score           421 non-null    float64
dtypes: float64(3), object(3)
memory usage: 22.5+ KB

In [47]:
data["sat_results"]["sat_score"] = data["sat_results"][cols].sum(axis = 1)

In [48]:
data["sat_results"].head()

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score,sat_score
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355.0,404.0,363.0,1122.0
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383.0,423.0,366.0,1172.0
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377.0,402.0,370.0,1149.0
3,01M458,FORSYTH SATELLITE ACADEMY,7,414.0,401.0,359.0,1174.0
4,01M509,MARTA VALLE HIGH SCHOOL,44,390.0,433.0,384.0,1207.0

In [52]:
pd.options.display.max_colwidth = None
data['hs_directory']["Location 1"].head(2)

0          50 Avenue\nX Brooklyn, NY 11223\n(40.589238098, -73.981746524)
1    284 Baltic Street\nBrooklyn, NY 11201\n(40.685451806, -73.993491465)
Name: Location 1, dtype: object

In [79]:
pattern = r'\((.+)\)'

coordinates = data['hs_directory']["Location 1"].str.extract(pattern)[0].str.split(",", expand = True)
coordinates.head()

                0               1
0    40.589238098   -73.981746524
1    40.685451806   -73.993491465
2    40.744149536   -73.933626741
3    40.815230365   -73.955201206
4    40.601989336   -73.762834323
..            ...             ...
430  40.765026708   -73.992516578
431  40.840373398   -73.910838008
432  40.696961848   -73.910815939
433  40.732485378   -73.983053388
434   40.58211615   -73.972894492

[435 rows x 2 columns]

In [81]:
data['hs_directory']["lat"] = coordinates[0]
data['hs_directory']["lon"] = coordinates[1]

In [82]:
data['hs_directory'].head()

,dbn,school_name,borough,building_code,phone_number,fax_number,grade_span_min,grade_span_max,expgrade_span_min,expgrade_span_max,...,Location 1,Community Board,Council District,Census Tract,BIN,BBL,NTA,DBN,lat,lon
0,21K540,John Dewey High School,Brooklyn,K540,718-373-6400,718-266-4385,9.0,12,NaN,NaN,...,"50 Avenue\nX Brooklyn, NY 11223\n(40.589238098, -73.981746524)",13.0,47.0,308.0,3194998.0,3.071850e+09,Gravesend,21K540,40.589238098,-73.981746524
1,15K429,Brooklyn School for Global Studies,Brooklyn,K293,718-694-9741,718-694-9745,6.0,12,NaN,NaN,...,"284 Baltic Street\nBrooklyn, NY 11201\n(40.685451806, -73.993491465)",6.0,33.0,69.0,3006401.0,3.004020e+09,DUMBO-Vinegar Hill-Downtown Brooklyn-Boerum Hill,15K429,40.685451806,-73.993491465
2,24Q530,International High School at LaGuardia Community College,Queens,Q520,718-392-3433,718-392-3443,9.0,12,NaN,NaN,...,"45 35 Van Dam Street\nLong Island City, NY 11101\n(40.744149536, -73.933626741)",2.0,26.0,179.0,4003442.0,4.002490e+09,Hunters Point-Sunnyside-West Maspeth,24Q530,40.744149536,-73.933626741
3,05M367,Academy for Social Action: A College Board School,Manhattan,M043,212-234-3102,212-234-8597,9.0,12,NaN,NaN,...,"509 West 129 Street\nNew York, NY 10027\n(40.815230365, -73.955201206)",9.0,7.0,219.0,1059723.0,1.019840e+09,Manhattanville,05M367,40.815230365,-73.955201206
4,27Q260,Frederick Douglass Academy VI High School,Queens,Q465,718-471-2154,718-471-2890,9.0,12,NaN,NaN,...,"8 21 Bay 25 Street\nFar Rockaway, NY 11691\n(40.601989336, -73.762834323)",14.0,31.0,100802.0,4300730.0,4.157360e+09,Far Rockaway-Bayswater,27Q260,40.601989336,-73.762834323

In [85]:
# coor = data['hs_directory']["Location 1"].str.extract(pattern)[0].str.split(",")
# coor.head().str[0]

# Data Transformation / Combining

In [93]:
data['class_size']['GRADE '].unique()

array(['0K', '01', '02', '03', '04', '05', '0K-09', nan, '06', '07', '08',
       'MS Core', '09-12', '09'], dtype=object)

In [95]:
data['class_size']["PROGRAM TYPE"].unique()

array(['GEN ED', 'CTT', 'SPEC ED', nan, 'G&T'], dtype=object)

In [96]:
class_size = data['class_size']

class_size = class_size[(class_size['GRADE '] == '09-12') & (class_size["PROGRAM TYPE"] == 'GEN ED')]

In [97]:
class_size.head()

,CSD,BOROUGH,SCHOOL CODE,SCHOOL NAME,GRADE,PROGRAM TYPE,CORE SUBJECT (MS CORE and 9-12 ONLY),CORE COURSE (MS CORE and 9-12 ONLY),SERVICE CATEGORY(K-9* ONLY),NUMBER OF STUDENTS / SEATS FILLED,NUMBER OF SECTIONS,AVERAGE CLASS SIZE,SIZE OF SMALLEST CLASS,SIZE OF LARGEST CLASS,DATA SOURCE,SCHOOLWIDE PUPIL-TEACHER RATIO,padded_csd,DBN
225,1,M,M292,Henry Street School for International Studies,09-12,GEN ED,ENGLISH,English 9,-,63.0,3.0,21.0,19.0,25.0,STARS,NaN,01,01M292
226,1,M,M292,Henry Street School for International Studies,09-12,GEN ED,ENGLISH,English 10,-,79.0,3.0,26.3,24.0,31.0,STARS,NaN,01,01M292
227,1,M,M292,Henry Street School for International Studies,09-12,GEN ED,ENGLISH,English 11,-,38.0,2.0,19.0,16.0,22.0,STARS,NaN,01,01M292
228,1,M,M292,Henry Street School for International Studies,09-12,GEN ED,ENGLISH,English 12,-,69.0,3.0,23.0,13.0,30.0,STARS,NaN,01,01M292
229,1,M,M292,Henry Street School for International Studies,09-12,GEN ED,MATH,Integrated Algebra,-,53.0,3.0,17.7,16.0,21.0,STARS,NaN,01,01M292

In [102]:
class_size = class_size.groupby("DBN").agg("mean").reset_index()

In [104]:
data['class_size'] = class_size

In [106]:
data['demographics']["schoolyear"].unique()

array([20052006, 20062007, 20072008, 20082009, 20092010, 20102011,
       20112012], dtype=int64)

In [107]:
demographics = data['demographics']

In [108]:
demographics = demographics[demographics["schoolyear"] == 20112012]

In [110]:
data['demographics'] = demographics

In [111]:
graduation = data['graduation']

In [113]:
graduation["Demographic"].unique()

array(['Total Cohort', 'Asian', 'Male', 'Black',
       'English Language Learners', 'Hispanic', 'White',
       'English Proficient Students', 'Special Education Students',
       'General Education Students', 'Female'], dtype=object)

In [114]:
graduation["Cohort"].unique()

array(['2003', '2004', '2005', '2006', '2006 Aug', '2001', '2002'],
      dtype=object)

In [115]:
graduation = graduation[(graduation["Demographic"] == 'Total Cohort') & (graduation["Cohort"] == '2006')]

In [116]:
graduation

,Demographic,DBN,School Name,Cohort,Total Cohort,Total Grads - n,Total Grads - % of cohort,Total Regents - n,Total Regents - % of cohort,Total Regents - % of grads,...,Regents w/o Advanced - n,Regents w/o Advanced - % of cohort,Regents w/o Advanced - % of grads,Local - n,Local - % of cohort,Local - % of grads,Still Enrolled - n,Still Enrolled - % of cohort,Dropped Out - n,Dropped Out - % of cohort
3,Total Cohort,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL,2006,78,43,55.1,36,46.2,83.7,...,36,46.2,83.7,7,9.0,16.3,16,20.5,11,14.1
10,Total Cohort,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,2006,124,53,42.7,42,33.9,79.2,...,34,27.4,64.2,11,8.9,20.8,46,37.1,20,16.1
17,Total Cohort,01M450,EAST SIDE COMMUNITY SCHOOL,2006,90,70,77.8,67,74.4,95.7,...,67,74.4,95.7,3,3.3,4.3,15,16.7,5,5.6
24,Total Cohort,01M509,MARTA VALLE HIGH SCHOOL,2006,84,47,56.0,40,47.6,85.1,...,23,27.4,48.9,7,8.3,14.9,25,29.8,5,6.0
31,Total Cohort,01M515,LOWER EAST SIDE PREPARATORY HIGH SCHO,2006,193,105,54.4,91,47.2,86.7,...,22,11.4,21.0,14,7.3,13.3,53,27.5,35,18.1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2482,Total Cohort,32K549,BUSHWICK SCHOOL FOR SOCIAL JUSTICE,2006,97,74,76.3,59,60.8,79.7,...,54,55.7,73.0,15,15.5,20.3,12,12.4,9,9.3
2489,Total Cohort,32K552,ACADEMY OF URBAN PLANNING,2006,115,55,47.8,41,35.7,74.5,...,40,34.8,72.7,14,12.2,25.5,44,38.3,10,8.7
2495,Total Cohort,32K554,ALL CITY LEADERSHIP SECONDARY SCHOOL,2006,43,36,83.7,23,53.5,63.9,...,18,41.9,50.0,13,30.2,36.1,5,11.6,2,4.7
2502,Total Cohort,32K556,BUSHWICK LEADERS HIGH SCHOOL FOR ACAD,2006,117,65,55.6,28,23.9,43.1,...,23,19.7,35.4,37,31.6,56.9,24,20.5,22,18.8
2509,Total Cohort,32K564,BUSHWICK COMMUNITY HIGH SCHOOL,2006,128,10,7.8,3,2.3,30.0,...,3,2.3,30.0,7,5.5,70.0,63,49.2,52,40.6

In [117]:
data['graduation'] = graduation

In [118]:
data['ap_2010'].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 258 entries, 0 to 257
Data columns (total 5 columns):
 #   Column                                Non-Null Count  Dtype
---  ------                                --------------  -----
 0   DBN                                   258 non-null    object
 1   SchoolName                            258 non-null    object
 2   AP Test Takers                        233 non-null    float64
 3   Total Exams Taken                     233 non-null    float64
 4   Number of Exams with scores 3 4 or 5  151 non-null    float64
dtypes: float64(3), object(2)
memory usage: 10.2+ KB

In [119]:
data.keys()

dict_keys(['ap_2010', 'class_size', 'demographics', 'graduation', 'hs_directory', 'sat_results', 'survey'])

In [120]:
combined = pd.merge(data['sat_results'], data['ap_2010'] , on = "DBN", how = "left")

In [121]:
data['graduation'].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 405 entries, 3 to 2509
Data columns (total 23 columns):
 #   Column                              Non-Null Count  Dtype
---  ------                              --------------  -----
 0   Demographic                         405 non-null    object
 1   DBN                                 405 non-null    object
 2   School Name                         405 non-null    object
 3   Cohort                              405 non-null    object
 4   Total Cohort                        405 non-null    int64
 5   Total Grads - n                     405 non-null    object
 6   Total Grads - % of cohort           378 non-null    float64
 7   Total Regents - n                   405 non-null    object
 8   Total Regents - % of cohort         378 non-null    float64
 9   Total Regents - % of grads          377 non-null    float64
 10  Advanced Regents - n                405 non-null    object
 11  Advanced Regents - % of cohort      378 non-null    float64
 12  Advanced Regents - % of grads       377 non-null    float64
 13  Regents w/o Advanced - n            405 non-null    object
 14  Regents w/o Advanced - % of cohort  378 non-null    float64
 15  Regents w/o Advanced - % of grads   377 non-null    float64
 16  Local - n                           405 non-null    object
 17  Local - % of cohort                 378 non-null    float64
 18  Local - % of grads                  377 non-null    float64
 19  Still Enrolled - n                  405 non-null    object
 20  Still Enrolled - % of cohort        378 non-null    float64
 21  Dropped Out - n                     405 non-null    object
 22  Dropped Out - % of cohort           378 non-null    float64
dtypes: float64(11), int64(1), object(11)
memory usage: 75.9+ KB

In [122]:
combined = pd.merge(combined, data['graduation'] , on = "DBN", how = "left")

In [123]:
cols = ['class_size', 'demographics','hs_directory', 'survey']

for c in cols:
    combined = pd.merge(combined, data[c] , on = "DBN", how = "inner")

In [124]:
combined.shape

(363, 165)

In [126]:
data['sat_results'].shape

(478, 7)

In [127]:
combined.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 363 entries, 0 to 362
Columns: 165 entries, DBN to aca_tot_11
dtypes: float64(67), int64(12), object(86)
memory usage: 470.8+ KB

In [128]:
combined.isnull().sum()

DBN                                 0
SCHOOL NAME                         0
Num of SAT Test Takers              0
SAT Critical Reading Avg. Score    28
SAT Math Avg. Score                28
                                   ..
aca_s_11                            3
saf_tot_11                          0
com_tot_11                          0
eng_tot_11                          0
aca_tot_11                          0
Length: 165, dtype: int64